Nuclex.Game.Packing.OutOfSpaceException
Insufficient space left in packing area to contain a given object
Remarks:
An exception being sent to you from deep space. Erm, no, wait, it's an exception
that occurs when a packing algorithm runs out of space and is unable to fit
the object you tried to pack into the remaining packing area.

Nuclex.Game.Packing.OutOfSpaceException.#ctor
Initializes the exception

Nuclex.Game.Packing.OutOfSpaceException.#ctor(System.String)
Initializes the exception with an error message
message: Error message describing the cause of the exception

Nuclex.Game.Packing.OutOfSpaceException.#ctor(System.String,System.Exception)
Initializes the exception as a followup exception
message: Error message describing the cause of the exception
inner: Preceding exception that has caused this exception

Nuclex.Game.Packing.OutOfSpaceException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes the exception from its serialized state
info: Contains the serialized fields of the exception
context: Additional environmental informations